let user = {
  name: 'Oleg',
  birthday: '25.10.1989',
  friends: [
    { name: 'Даша', birthday: '25.11.1988' },
    { name: 'Егор', birthday: '25.10.1985' },
    { name: 'Саша', birthday: undefined },
    { name: 'Дима', birthday: '25.10.1985' }
  ],
  myCars: []
};

/*
 -> Задание Напишите цикл, который отобразит в консоле имя
 пользователя и отобразит имена всех друзей.
 Если дата рождения неизвестна, тогда данного друга не отображать.
 */

/*
 Напишите функцию, которая принимает 2 аргумента: массив и число.
 И возвращает сумму чисел в массиве которые больше заданного второго аргумента
 */
